app/Models/ModeloPerso.php

        public function insertar($datos){

            $persona =$this->db->table('Persona');
            $persona->insert($datos);
---
INSERT INTO `Persona` (`Nombre`, `Numero`, `Email`, `contra`) VALUES ('emanuel', '7894561', 'vicky@emajasd', '231231223')